source/html/backend/components/Myclass.php

SELECT * FROM `hts_sitesettings` WHERE `id`='1'
---
	public static function getLogo() {
		$id = 1;
		$setting = Sitesettings::find()->where(['id'=>'1'])->one();

SELECT * FROM `hts_reservations` WHERE (`bookstatus`='requested') AND (`cdate` BETWEEN '2026-01-01' AND '2026-01-31')
---
	public static function getRequsted($sdate,$edate)
	{
		$reservations = Reservations::find()->where(['bookstatus'=>'requested'])
											->andwhere(['between', 'cdate', $sdate, $edate])
											->all();

SELECT * FROM `hts_reservations` WHERE (`bookstatus`='accepted') AND (`cdate` BETWEEN '2026-01-01' AND '2026-01-31')
---
	public static function getAccepted($sdate,$edate)
	{
		$reservations = Reservations::find()->where(['bookstatus'=>'accepted'])
											->andwhere(['between', 'cdate', $sdate, $edate ])
											->all();

SELECT * FROM `hts_reservations` WHERE (`bookstatus`='declined') AND (`cdate` BETWEEN '2026-01-01' AND '2026-01-31')
---
	public static function getDeclined($sdate,$edate)
	{
		$reservations = Reservations::find()->where(['bookstatus'=>'declined'])
											->andwhere(['between', 'cdate', $sdate, $edate ])
											->all();

SELECT * FROM `hts_reservations` WHERE (`bookstatus`='cancelled') AND (`cdate` BETWEEN '2026-01-01' AND '2026-01-31')
---
	public static function getCancelled($sdate,$edate)
	{
		$reservations = Reservations::find()->where(['bookstatus'=>'cancelled'])
											->andwhere(['between', 'cdate', $sdate, $edate ])
											->all();

SELECT * FROM `hts_reservations` WHERE (`bookstatus` NOT IN ('cancelled', 'declined')) AND (`cdate` BETWEEN '2026-01-01' AND '2026-01-31')
---
	public function getTurnover($sdate,$edate)
	{
		$reservations = Reservations::find()->where(['not in','bookstatus',['cancelled','declined']])
											->andwhere(['between', 'cdate', $sdate, $edate ])
											->all();

SELECT * FROM `hts_currency` WHERE `currencycode`='$'
---
	public static function getcurrencyprice($currencyCode) {
		$defaultCur = Currency::find()->where(['currencycode'=>$currencyCode])->one();

SELECT * FROM `hts_currency` WHERE `id`=1
---
	public static function getcurrencyidprice($currencyId) {
		$defaultCur = Currency::find()->where(['id'=>$currencyId])->one();