source/html/frontend/modules/user/views/listing/view.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
   {
      echo '<div class="errcls centertxt" id="maxstayerr"></div>
       <div class="padding10 margin_left5 margin_right5">';
        $sitesetting =  Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_shippingaddress` WHERE `userid`=82
---
                $mobileverify = ($userdata->mobileverify == 1) ? '󰀙 '.Yii::t('app','verified') : Yii::t('app','Not verified');
                $emailverify = ($userdata->emailverify == 1) ? '󰀙 '.Yii::t('app','verified') : Yii::t('app','Not verified');

                $shipping = Shippingaddress::find ()->where (['userid'=>$model->userid])->One();

SELECT * FROM `hts_currency` WHERE (`id`=1) AND (`id`=1)
---
                   foreach($similarlisting as $similarlist)
                   {

                       $listcurrency = $similarlist->getCurrency0()->where(['id'=>$similarlist->currency])->one();

SELECT * FROM `hts_roomtype` WHERE (`id`=1) AND (`id`=1)
SELECT * FROM `hts_hometype` WHERE (`id`=1) AND (`id`=1)
SELECT * FROM `hts_photos` WHERE (`listid`=49) AND (`listid`=49)
---

                       $similarlistrate = Myclass::getcurrencyidprice($similarlist->currency); //listing currency

                       $roomtype = $similarlist->getRoomtype0()->where(['id'=>$similarlist->roomtype])->one();
                       $hometype = $similarlist->getHometype0()->where(['id'=>$similarlist->hometype])->one();
                       $photos = $similarlist->getPhotos()->where(['listid'=>$similarlist->id])->all();

SELECT * FROM `hts_users` WHERE (`id`=82) AND (`id`=82)
---
                          $listphoto = Yii::$app->urlManager->createAbsoluteUrl ( '/albums/images/users/usrimg.jpg');

                       $listimageurl = Yii::$app->urlManager->createAbsoluteUrl ('resized.php?src='.$listphoto.'&w=465&h=330');
                       $listuserdata = $similarlist->getUser()->where(['id'=>$similarlist->userid])->one();