source/html/backend/views/layouts/main.php

SELECT * FROM `hts_sitesettings` WHERE `id`='1'
---

AppAsset::register($this);

$sitesetting = Sitesettings::find()->where(['id'=>'1'])->one();