source/html/backend/views/admins/activelisting.php

                'value' => function( $model )
                {

                    $getHomemodel = Hometype::find()->where(['id'=>$model->hometype])->One();
---
SELECT * FROM `hts_hometype` WHERE `id`=12

                'label' => Yii::t('app',  'Host Name'),
                'value' => function( $model )
                {
                    $Users = Users::find()->where(['id'=>$model->userid])->One();
---
SELECT * FROM `hts_users` WHERE `id`=82