source/html/frontend/controllers/UsersController.php

	public function actionIndex() {

		if (!(Yii::$app->user->isGuest)) {
	    	$loguserid = \Yii::$app->user->identity->id;
	    	$logUserDetails = User::find()->where(['id' => $loguserid])->One();
	    	if($logUserDetails->userstatus != '1') {
        		Yii::$app->getSession ()->setFlash ( 'success', 'Sorry user access blocked by admin.' );
        		Yii::$app->user->logout ();
        		return $this->goHome ();
      	}
    	}

		$homesettings = Homepagesettings::find()->where(['id'=>'1'])->one();
		$buttonsliders = Buttonsliders::find('all')->all();
		$textsliders = Textsliders::find('all')->all();
		$sitesettings = Sitesettings::find()->where(['id'=>'1'])->one();
---
SELECT * FROM `hts_homepagesettings` WHERE `id`='1'
SELECT * FROM `hts_sitesettings` WHERE `id`='1'


		$models = new PasswordResetRequestForm ();

		$listings = Listing::find()->where(['liststatus'=>1])
		->andWhere([
					'or',
				   ['>','nightlyprice','0'],
				   ['>','hourlyprice','0']
				]) ->orderBy('id desc')->all();
---
SELECT * FROM `hts_listing` WHERE (`liststatus`=1) AND ((`nightlyprice` > '0') OR (`hourlyprice` > '0')) ORDER BY `id` DESC

			$getreviews = $Reviews->getRatingbylisting($getrating['listid']);
			$traverselist[$c]['ratings'] = $getreviews['rating'];
			$traverselist[$c]['n_rating'] =  $getreviews['n_rating'];
			$getReservePhotos = Photos::find()->where(['listid'=>$getrating['listid']])->orderBy('id asc')->one();
---
SELECT * FROM `hts_photos` WHERE `listid`=49 ORDER BY `id`

			$c++;
		}

		$listingproperties = Listingproperties::find()->where(['id'=>'1'])->one();
---
SELECT * FROM `hts_listingproperties` WHERE `id`='1'

			$_SESSION['currency_code'] = trim($_SESSION['currency_code']);
			$_SESSION['currency_symbol'] = trim($_SESSION['currency_symbol']);
		} else {
			$currencydata = Currency::find()->where(['defaultcurrency'=>1])->one();
---
SELECT * FROM `hts_currency` WHERE `defaultcurrency`=1

	public function actionCurrencyupdate() {
		// Developer - AK
		$Sitesettings = Sitesettings::find()->where(['id'=>'1'])->one();
		if($Sitesettings->autoupdate_currency==1)
     	{
			$defaultCur = Currency::find()->where(['defaultcurrency'=>'1'])->one();
			if(!empty($defaultCur))
			{
				$defaultcurrency=$defaultCur->currencycode;
				$model = Currency::find()->all();
				foreach ($model as $key => $models) {
					$staticCurrency=$models->currencycode;
					$curId=$models->id;
					$currencyTbl = Currency::find()->where(['id'=>$curId])->one();
---
SELECT * FROM `hts_sitesettings` WHERE `id`='1'
SELECT * FROM `hts_currency` WHERE `defaultcurrency`='1'
SELECT * FROM `hts_currency`
SELECT * FROM `hts_currency` WHERE `id`=1