source/html/backend/modules/admin/controllers/ButtonsliderController.php

INSERT INTO `hts_buttonsliders` (`sliderimage`, `title`, `description`, `buttonname`, `buttonlink`) VALUES ('1768041909.jpg', 'testing', 'techno  services ', 'testing  button', 'test')
---
        $model->buttonname  = $_POST['Buttonsliders']['buttonname'] ?? '';
        $model->buttonlink  = $_POST['Buttonsliders']['buttonlink'] ?? '';

        if ($model->sliderimage && $model->save(false)) {

SELECT * FROM `hts_buttonsliders` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Buttonsliders::findOne($id)) !== null) {