source/html/backend/controllers/AdminsController.php

    public function actionDashboard()
    {

    	if (Yii::$app->user->isGuest) {
    		return $this->goHome();
		}

		$model = new Users();
		$usermodel = Users::find()->where(['!=','user_level','god'])->count();
    	$activeuser = Users::find()->where(['!=','user_level','god'])->andWhere(['!=','userstatus','0'])->count();
    	$blockuser = Users::find()->where(['!=','user_level','god'])->andWhere(['=','userstatus','0'])->count();
    	$activelist = Listing::find()->where(['=','liststatus','1'])->count();
---
SELECT COUNT(*) FROM `hts_users` WHERE `user_level` != 'god'
SELECT COUNT(*) FROM `hts_users` WHERE (`user_level` != 'god') AND (`userstatus` != '0')
SELECT COUNT(*) FROM `hts_users` WHERE (`user_level` != 'god') AND (`userstatus` = '0')
SELECT COUNT(*) FROM `hts_listing` WHERE `liststatus` = '1'

	public function actionActivelisting()
	{
		if (Yii::$app->user->isGuest) {
	      return $this->goHome ();
	   }
		 $blockeduserids = array();
		 $blockedusers = Users::find()->where(['hoststatus' => '0'])
						->andWhere(['!=', 'user_level', 'god'])
		 				->all();
---
SELECT * FROM `hts_users` WHERE (`hoststatus`='0') AND (`user_level` != 'god')

	public function actionPendinglisting()
	{
		if (Yii::$app->user->isGuest) {
			return $this->goHome ();
		}

		$blockeduserids = array();
		$blockedusers = Users::find()->where(['hoststatus' => '0'])
						  ->andWhere(['!=', 'user_level', 'god'])
						   ->all();
---
SELECT * FROM `hts_users` WHERE (`hoststatus`='0') AND (`user_level` != 'god')

	public function actionBlockedlisting()
	{
		if (Yii::$app->user->isGuest) {
	      return $this->goHome ();
	   }
		 $blockeduserids = array();
		 $blockedusers = Users::find()->where(['hoststatus' => '0'])
						->andWhere(['!=', 'user_level', 'god'])
		 				->all();
---
SELECT * FROM `hts_users` WHERE (`hoststatus`='0') AND (`user_level` != 'god')

	public function actionAlterliststatus()
	{
		Yii::$app->controller->enableCsrfValidation = false;
		if (Yii::$app->user->isGuest) {
			return $this->goHome();
		}
		$status = $_POST['status'];
		$listid = $_POST['listid'];
		$listdata = Listing::find()->where(['id'=>$listid])->one();

		if(!empty($listdata))
		{
			if($status=="block")
			{
				$listdata->liststatus = "2";
				$listdata->save(false);
---
SELECT * FROM `hts_listing` WHERE `id`='58'
UPDATE `hts_listing` SET `liststatus`=2 WHERE `id`=58