source/html/frontend/components/MyComponent.php

SELECT * FROM `hts_sitesettings` WHERE `id`='1'
---
	public static function getLogo() {
		$id = 1;
		$setting = Sitesettings::find()->where(['id'=>'1'])->one();

SELECT * FROM `hts_listingproperties` WHERE `id`='1'
---
	public static function getListingproperty() {
		$id = 1;
		$listingproperty = Listingproperties::find()->where(['id'=>'1'])->one();