source/html/frontend/models/Listing.php

    public function getListing()
    {
        //return Listing::find()->where(['featuredlist' => '1'])->limit('8')->all();
        return Listing::find()->where(['featuredlist' => '1', 'liststatus'=>'1'])->orderBy('featuredate desc')->all();
---
SELECT * FROM `hts_listing` WHERE (`featuredlist`='1') AND (`liststatus`='1') ORDER BY `featuredate` DESC