source/html/frontend/models/Reviews.php

    public function getRatingbylisting( $listid )
    {
        $getreviewbylist = Reviews::find()->where(['listid'=>$listid])->all();
---
SELECT * FROM `hts_reviews` WHERE `listid`='53'

    public function getRatingbyuser( $userid )
    {
        $getreviewbylist = Reviews::find()->where(['userid'=>$userid])->all();
---
SELECT * FROM `hts_reviews` WHERE `userid`=82