source/html/frontend/models/SignupForm.php

    public static function findIdentity($id)
    {
         $user = User::find()->where(['id' => $id])->one();
---
SELECT * FROM `hts_users` WHERE `id`=82