source/html/frontend/views/users/index.php

              break;
      //foreach($recent as $recentlist)
      //{
                    $listcurrency = $recentlist->getCurrency0()->where(['id'=>$recentlist->currency])->one();
---
SELECT * FROM `hts_currency` WHERE (`id`=1) AND (`id`=1)


          }

                    $roomtype = $recentlist->getRoomtype0()->where(['id'=>$recentlist->roomtype])->one();


                    $photos = $recentlist->getPhotos()->where(['listid'=>$recentlist->id])->all();
---
SELECT * FROM `hts_roomtype` WHERE (`id`=1) AND (`id`=1)
SELECT * FROM `hts_photos` WHERE (`listid`=51) AND (`listid`=51)

                    else
                    $listphoto = Yii::$app->urlManager->createAbsoluteUrl ( '/albums/images/users/usrimg.jpg');
                    $listimageurl = Yii::$app->urlManager->createAbsoluteUrl ('resized.php?src='.$listphoto.'&w=465&h=330');
                    $listuserdata = $recentlist->getUser()->where(['id'=>$recentlist->userid])->one();
---
SELECT * FROM `hts_users` WHERE (`id`=82) AND (`id`=82)

              break;
      //foreach($recent as $recentlist)
      //{
                    $listcurrency = $recentlist->getCurrency0()->where(['id'=>$recentlist->currency])->one();
---
SELECT * FROM `hts_currency` WHERE (`id`=1) AND (`id`=1)

          }


                    $roomtype = $recentlist->getRoomtype0()->where(['id'=>$recentlist->roomtype])->one();


                    $photos = $recentlist->getPhotos()->where(['listid'=>$recentlist->id])->all();
---
SELECT * FROM `hts_roomtype` WHERE (`id`=1) AND (`id`=1)
SELECT * FROM `hts_photos` WHERE (`listid`=57) AND (`listid`=57)

                    else
                    $listphoto = Yii::$app->urlManager->createAbsoluteUrl ( '/albums/images/users/usrimg.jpg');
                    $listimageurl = Yii::$app->urlManager->createAbsoluteUrl ('resized.php?src='.$listphoto.'&w=465&h=330');
                    $listuserdata = $recentlist->getUser()->where(['id'=>$recentlist->userid])->one();
---
SELECT * FROM `hts_users` WHERE (`id`=82) AND (`id`=82)