source/html/common/models/User.php

SELECT * FROM `hts_users` WHERE (`id` <> 0) AND (`id`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);